# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\New_Dell_Laptop_18.04.2021\Drive_D\hda\Summer_Semester_2020\Embedded Architecture and Application\Lab1\Work_Space_RTE\RTE_Electronic_Clock.cydsn\RTE_Electronic_Clock.cyprj
# Date: Mon, 07 Nov 2022 20:28:50 GMT
#set_units -time ns
create_clock -name {JOYSTICK_ADC_XY_IntClock(routed)} -period 541.66666666666663 -waveform {0 270.833333333333} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {PWM_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 7} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {JOYSTICK_ADC_XY_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 13 27} -nominal_period 541.66666666666663 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_LOG_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for E:\New_Dell_Laptop_18.04.2021\Drive_D\hda\Summer_Semester_2020\Embedded Architecture and Application\Lab1\Work_Space_RTE\RTE_Electronic_Clock.cydsn\TopDesign\TopDesign.cysch
# Project: E:\New_Dell_Laptop_18.04.2021\Drive_D\hda\Summer_Semester_2020\Embedded Architecture and Application\Lab1\Work_Space_RTE\RTE_Electronic_Clock.cydsn\RTE_Electronic_Clock.cyprj
# Date: Mon, 07 Nov 2022 20:28:28 GMT
